Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh3808-v3.tmx
Source language: bo
Languages: en

source: གཟུངས་ཞེས་བྱ་བ་ནི་སྔར་བྱང་ཆུབ་སེམས་དཔའི་ཡོན་ཏན་བསྟན་པར་བརྗོད་པའི་རྣམ་པས་བཟོད་པའི་གཟུངས་དང་། ཆོས་ཀྱི་གཟུངས་དང་། དོན་གྱི་གཟུངས་དང་། སྔགས་ཀྱི་གཟུངས་དང་བཞི་ལ་གཟུངས་ཞེས་བྱའོ།
en: As for “dhāraṇī,” earlier in the explanation teaching the good qualities of bodhisattvas, the four—forbearance dhāraṇī, doctrine dhāraṇī, meaning dhāraṇī, and mantra dhāraṇī—are called dhāraṇī.

source: །གཟུངས་དེ་དག་གི་སྒོ་དག་ནི་གཟུངས་ཀྱི་སྒོ་རྣམས་ཏེ་ཡི་གེ་རྣམས་སོ།
en: The “gateways” of those dhāraṇīs are the letters.

source: །ཡི་གེ་ངེས་པར་བསམ་པའི་སྟོབས་ཀྱིས་གཟུངས་འདི་བཞི་འབྱུང་བར་འགྱུར་རོ།
en: These four dhāraṇīs come about through the power of pondering those letters.

source: །ཡི་གེ་དེ་དག་གི་ཚུལ་གང་ཡིན་ཞེ་ན།
en: What is the way those letters work? “

source: ཡི་གེའི་ཚུལ་ནི་ཡང་དག་པའི་དོན་རབ་ཏུ་རྟོགས་པའོ།
en: The way they work” is that through them the perfect meaning is thoroughly realized.

source: །ཡི་གེའི་ཚུལ་མཉམ་པ་ཉིད་ནི་ཡི་གེའི་ཚུལ་མཉམ་པ་ཉིད་དེ་ཨ་ཞེས་བྱ་བ་ལ་སོགས་པ་ཡི་གེ་འབྲུ་ཐམས་ཅད་ནི་སྐྱེ་བ་མེད་པ་ལ་སོགས་པ་དེ་བཞིན་ཉིད་ཀྱི་རང་བཞིན་རབ་ཏུ་རྟོགས་པར་བྱེད་པས་ཡི་གེའི་ཚུལ་མཉམ་པ་ཉིད་ཅེས་བྱའོ།
en: The fact that the letters work in the same way is “the sameness of the way the letters work.” Through all of the letters, a and so on, the nature of suchness that is “not produced” (anutpanna) and so on is thoroughly realized.

source: །མཉམ་པ་ཉིད་དེ་དག་ལ་དམིགས་ནས་ཡེ་ཤེས་བྱུང་བ་ལ་ཡང་ཡི་གེའི་ཚུལ་མཉམ་པ་ཉིད་ཅེས་བྱའོ།
en: This is “the sameness of the way the letters work.” Having taken those samenesses as the objective support, knowledge arises, hence it says “the sameness of the way the letters work.”

source: །ཡི་གེ་རྣམས་ནི་འདིའི་སྒོ་ཡིན་པས་ཡི་གེ་ནི་ཡེ་ཤེས་ཀྱི་སྒོའོ།
en: Because the letters are the gateways to that, the letters are “letters as gateways.”

source: །ཡི་གེ་རྣམས་ཀྱི་འཇུག་པས་ན་ཡི་གེ་འཇུག་པ་སྟེ། ཡི་གེའི་དབང་གིས་ཡེ་ཤེས་དེ་འཇུག་གོ།
en: Because they enter in through the letters there is “entrance through letters,” which is to say, that knowledge comes about through the force of the letters. “

source: །ཨ་ཞེས་བྱ་བ་ནི་གཟོད་མ་ནས་མ་སྐྱེས་པའི་ཕྱིར་ཆོས་ཐམས་ཅད་ཀྱི་སྒོའོ་ཞེས་བྱ་བ་ལ་ཨ་ཞེས་བྱ་བ་ནི་ཆོས་ཐམས་ཅད་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་དུ་རབ་ཏུ་རྟོགས་པར་འགྱུར་བའི་སྒོ་སྟེ། འཇུག་པར་བྱེད་པ་དང་རྒྱུ་ཡིན་ནོ།
en: The letter a is the gateway to all dharmas because they are unproduced from the very beginning (ādy-anutpannatvād).” The a is a gateway for gazing on all dharmas as they actually are because it causes engagement and is the cause.

source: གཟོད་མ་ནས་མ་སྐྱེས་པའི་ཕྱིར་ཏེ།
en: Because they are unproduced from the beginning (ādi).

source: འདི་ལྟར་ཆོས་ཐམས་ཅད་ནི་གཟོད་མ་ནས་དྲི་མ་དང་བཅས་པའི་གནས་སྐབས་ཉིད་ན།
en: Thus, from the beginning, during the period when all dharmas have stains, they are unproduced.

source: མ་སྐྱེས་པ་སྟེ་དེ་བས་ན་རྣལ་འབྱོར་སྤྱོད་པས་མ་སྐྱེས་པའི་དོན་འདི་ཨ་ཞེས་བྱ་བ་ལ་མ་སྐྱེས་པའི་དོན་དུ་སྒྲོ་བཏགས་ནས་བསྒོམ་པ་ན་གོམས་པའི་སྟོབས་ཀྱིས་ཨ་ཞེས་བྱ་བ་ཙམ་ཤིན་ཏུ་བསྒོམས་པས་ཆོས་ཐམས་ཅད་སྐྱེ་བ་མེད་པའི་བཟོད་པ་འཐོབ་པོ།
en: So, when yogic practitioners, having projected the meaning unproduced onto the letter a, meditate on the meaning of being unproduced, then, through the force of habituation, just from having meditated on a so intensely they gain forbearance for all dharmas being “unproduced.”

source: །དེ་བཞིན་དུ་ར་ཞེས་བྱ་བ་ལ་རྡུལ་དང་བྲལ་བའི་དོན་སྒྲོ་བཏགས་ནས་ཤིན་ཏུ་བསྒོམས་པས་ཆོས་ཐམས་ཅད་རྡུལ་དང་བྲལ་བའི་བཟོད་པ་ཐོབ་སྟེ།
en: Similarly, having projected the meaning “without dirt (rajas)” onto “ra,” just from having meditated on ra so intensely they gain forbearance for all dharmas being “without dirt.”

source: དེ་ལས་བཟོད་པའི་གཟུངས་སུ་འགྱུར་རོ།
en: From that they become forbearance dhāraṇīs.

source: །དེ་ལྟར་སྔར་གླེང་གཞི་བསྟན་པར་བཤད་པའི་ཚུལ་གྱིས་ཕྱོགས་བཅུའི་སངས་རྒྱས་རྣམས་དང་། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྣམས་ཀྱིས་ཆོས་བཤད་པ་རྒྱ་ཆེན་པོ་ཤིན་ཏུ་མྱུར་བར་འབྱུང་བའི་ཚོགས་འཛིན་པའི་རྒྱུར་གྱུར་པ་ནི་ཆོས་ཀྱི་གཟུངས་སོ། །ཆོས་དེ་རྣམས་ཀྱི་དོན་ཡང་དག་པར་འཛིན་པའི་རྒྱུར་གྱུར་པ་ནི་དོན་གྱི་གཟུངས་སོ། །སེམས་ཅན་ཐམས་ཅད་ཀྱི་ཡམས་ཀྱི་ནད་དང་། གནོད་པ་ཞི་བར་བྱེད་པའི་གསང་སྔགས་ཀྱི་གཞི་རྣམས་ནི་གསང་སྔགས་ཀྱི་གཟུངས་སོ།
en: Thus, earlier in the explanation of the teaching in the Introduction chapter the way they are explained is that they are doctrine dhāraṇīs when they have become causes for perfectly bearing in mind, extremely swiftly, the collections of the expositions of doctrine in great detail by buddhas and bodhisattva great beings in the ten directions; they are meaning dhāraṇīs when they have become causes for perfectly bearing in mind the meanings of those doctrines; and they are secret mantra dhāraṇīs as bases (ādhārāṇi) of the secret mantras that stop the plagues and problems of all beings.

source: །དེ་དག་ཐམས་ཅད་ཀྱང་ཡི་གེའི་རྒྱུ་ལས་བྱུང་བ་ཉིད་དེ། དེ་བས་ན་གཟུངས་ཀྱི་སྒོར་གྱུར་པའི་ཕྱིར་ཡི་གེ་རྣམས་ནི་གཟུངས་ཀྱི་སྒོ་རྣམས་ཏེ།
en: All of them, furthermore, arise with letters as their cause, so letters are “dhāraṇī gateways” because they are the gateways into the dhāraṇīs.

source: དེ་དག་ལ་དམིགས་པ་ལས་བྱུང་བའི་ཡེ་ཤེས་ལ་ཡང་གཟུངས་ཀྱི་སྒོ་ཞེས་བྱའོ།
en: The knowledge that comes about from taking those as a basis is also called a “dhāraṇī gateway.” “

source: །མ་སྐྱེས་པའི་ཕྱིར་ཞེས་བྱ་བ་ལ་སོགས་པ་ནི་དེ་བཞིན་ཉིད་ཀྱི་ཆོས་རྣམས་ཏེ། འདི་ལྟར་ནམ་མཁའ་དང་མཚུངས་སོ། །འདི་ལྟར་ནམ་མཁའ་མ་སྐྱེས་པ་བཞིན་དུ་དེ་བཞིན་ཉིད་ཀྱང་མ་སྐྱེས་པའོ། །འདི་ལྟར་ནམ་མཁའ་རྡུལ་ཀྱིས་མ་གོས་པའི་ཕྱིར་རྡུལ་དང་བྲལ་བ་དེ་བཞིན་དུ་དེ་བཞིན་ཉིད་ཀྱང་རྡུལ་དང་བྲལ་བའོ།
en: Unproduced,” and so on, are attributes of suchness, because it is like space, because just as space is “unproduced,” suchness is similarly unproduced; and because just as space is “without dirt,” suchness is similarly without dirt. “

source: །དོན་དམ་པར་ཁྱད་པར་མེད་པའི་ཕྱིར་རོ་ཞེས་བྱ་བ་ནི་དོན་དམ་པར་ཐ་དད་མེད་པའི་ཕྱིར་གཅིག་གོ།
en: Because they are ultimately without distinctions”— they are one because ultimately they are not different. “

source: །འཆི་འཕོ་དང་སྐྱེ་བ་མི་དམིགས་པའི་ཚུལ་གྱིས་ཞེས་བྱ་བ་ནི་དེ་བཞིན་ཉིད་ལ་འཆི་བའི་སྲིད་པ་དང་། སྐྱེ་བའི་སྲིད་པ་དག་མི་དམིགས་པའི་སྲིད་པས་ཞེས་བྱ་བའི་ཐ་ཚིག་གོ།
en: Because of the way death and rebirth are unfindable” means because suchness is a state where a birth state and death state are unfindable. “

source: །མིང་མི་དམིགས་པའི་ཚུལ་གྱིས་ཞེས་བྱ་བ་ནི་དེ་བཞིན་ཉིད་ལ་མིང་དུ་བརྗོད་པ་མེད་པའི་ཕྱིར་རོ།
en: Because of the way names are unfindable”— because in suchness, as names, they are inexpressible. “

source: །འཇིག་རྟེན་ལས་འདས་ཤིང་ཞེས་བྱ་བ་ནི་དེ་བཞིན་ཉིད་འཇིག་རྟེན་ལས་འདས་པའི་ཕྱིར་རོ།
en: They transcend the ordinary world” because suchness transcends the world. “

source: །སྲིད་པའི་འཁྲི་ཤིང་གི་རྒྱུ་དང་རྐྱེན་ཡང་དག་པར་བཅོམ་པའི་ཕྱིར་ཞེས་བྱ་བ་ནི་དེ་བཞིན་ཉིད་ནི་སྲིད་པའི་འཁྲི་ཤིང་གི་རྒྱུ་དང་རྐྱེན་གང་ཡིན་པ་དེ་དག་ཡང་དག་པར་བཅོམ་པའི་ངོ་བོ་ཉིད་ཡིན་པའི་ཕྱིར་རོ།
en: Because the vine of existence and the causes and conditions have been destroyed”— because suchness in its nature destroys the causes and conditions of the vine of existence. “

source: །དུལ་བ་དང་དུལ་བར་གནས་པ་ཡོངས་སུ་ངེས་པའི་ཕྱིར་ཞེས་བྱ་བ་ནི་དེ་བཞིན་ཉིད་དུ་དུལ་བར་བྱེད་པ་ཉོན་མོངས་པ་རྣམས་དང་།
en: Because tamed and staying tamed have a certain limit”— because the afflictions that are tamed, and the actions that have staying tamed as their intrinsic nature, do not exist in suchness, “tamed and staying tamed have a certain limit.” “

source: མ་དུལ་བར་གནས་པའི་ངོ་བོ་ཉིད་ཀྱི་ལས་རྣམས་མེད་པའི་ཕྱིར་དུལ་བ་དང་དུལ་བར་གནས་པ་ཉིད་དུ་ཡོངས་སུ་ངེས་པའོ། །བཅིངས་པ་ལས་རྣམ་པར་གྲོལ་བའི་ཕྱིར་ཞེས་བྱ་བ་ནི་འདོད་ཆགས་དང་། ཞེ་སྡང་དང་། གཏི་མུག་གི་བཅིང་བ་གསུམ་པོ་དག་ལས་གྲོལ་བའི་ཕྱིར་རོ། །ཁྲག་འཁྲུགས་པ་དང་བྲལ་བའི་ཕྱིར་ཞེས་བྱ་བ་ནི་ཉོན་མོངས་པ་དང་།
en: Because they are free from bonds”— because they are free from all three “bonds”: greed, hatred, and confusion. “

source: ལས་དང་རྣམ་པར་སྨིན་པའི་དབང་གིས་ཁྲག་འཁྲུགས་དང་རྣམ་པར་གཡེང་བར་གྱུར་པ་གང་ཡིན་པ་དེ་དག་དང་བྲལ་བར་གྱུར་པའི་ཕྱིར་རོ།
en: Because disorder has gone”— because any “disorder” or distraction that has come about through the force of afflictions, karma, and maturation has gone. “

source: །ཆགས་པ་མི་དམིགས་པའི་ཕྱིར་ཞེས་བྱ་བ་ནི་ཉོན་མོངས་པའི་སྒྲིབ་པའི་ཆགས་པ་དང་། ལས་ཀྱི་སྒྲིབ་པའི་ཆགས་པ་དང་། རྣམ་པར་སྨིན་པའི་སྒྲིབ་པའི་ཆགས་པ་མེད་པའི་ཕྱིར་རོ།
en: Because attachment is unfindable”— because the attachment that is an afflicted obscuration, the attachment that is a karmic obscuration, and the attachment that is a maturation obscuration are unfindable. “

source: །ངག་གི་ལམ་གྱི་སྒྲ་ཡང་དག་པར་ཆད་པའི་ཕྱིར་ཞེས་བྱ་བ་ནི་ངག་གི་ཐ་སྙད་ཀྱི་བདག་ཉིད་ཀྱི་སྒྲ་རྣམས་ཡང་དག་པར་ཆད་པའི་ཕྱིར་རོ།
en: Because the sound of speech paths has been cut”— because language that is in its nature the convention of speech has been cut. “

source: །དེ་བཞིན་ཉིད་ལས་མ་གཡོས་པའི་ཕྱིར་ཞེས་བྱ་བ་ནི་དེ་བཞིན་ཉིད་ཀྱི་རང་གི་ངོ་བོ་ཉིད་ལས་རྣམ་པར་མ་གཡོས་པའི་ཕྱིར་རོ།
en: Because they do not wander from suchness”— because they do not wander away from their own intrinsic nature, suchness. “

source: །ཇི་ལྟ་བ་བཞིན་དུ་མ་སྐྱེས་པའི་ཕྱིར་ཞེས་བྱ་བ་ནི་ཇི་ལྟར་རིགས་པར་མ་སྐྱེས་པའི་ཕྱིར་རོ།
en: Because in fact they are not produced”— because it is logical they are not produced. “

source: །ཁེངས་པ་མི་དམིགས་པའི་ཕྱིར་ཞེས་བྱ་བ་ནི་ཁེངས་པ་ཞེས་བྱ་བ་ཉེ་བའི་ཉོན་མོངས་པ་འམ། ཉོན་མོངས་པའི་རྣམ་པར་རྟོག་པ་ལས་གྱུར་པའི་ཁེངས་པ་མེད་པའི་ཕྱིར་རོ།
en: Because they have nothing to be pretentious about”— because the pretentiousness that is a secondary afflictive emotion, or that comes about from the affliction of conceptualization, does not exist. “

source: །བྱེད་པ་པོ་མི་དམིགས་པའི་ཕྱིར་ཞེས་བྱ་བ་ནི་བྱེད་པ་པོ་ཞེས་བྱ་བ་གང་ཟག་གམ་དབང་ཕྱུག་ལ་སོགས་པ་མི་མཐུན་པའི་རྒྱུ་རྣམས་སམ། རྒྱུ་དང་རྐྱེན་གྱི་ཆོས་རྣམས་དམིགས་སུ་མེད་པའི་ཕྱིར་རོ།
en: Because an agent is unfindable”— because “an agent”—a person or Īśvara and so on that are a dissimilar cause—or things that are causes and conditions, are unfindable. “

source: །མཉམ་པ་ཉིད་ལས་མི་འདའ་ཞེས་བྱ་བ་ནི་ཆོས་ཐམས་ཅད་ལ་མཉམ་པ་ཉིད་ལས་མི་འདའ་བའི་ཕྱིར་རོ་ཞེས་བྱ་བའི་ཐ་ཚིག་གོ།
en: They do not pass beyond sameness” means all phenomena do not pass beyond being the same. “

source: །ང་ཡིར་འཛིན་པ་མི་དམིགས་པའི་ཕྱིར་ཞེས་བྱ་བ་ནི་སྲེད་པས་བདག་གིར་འཛིན་པ་མེད་པའི་ཕྱིར་རོ།
en: Because taking something as ‘mine’ is unfindable”— because taking something as ‘mine’ because of craving does not exist. “

source: །འགྲོ་བ་མི་དམིགས་པའི་ཕྱིར་ཞེས་བྱ་བ་ནི་བདེ་འགྲོ་དང་། ངན་འགྲོའི་དབང་གིས་སྐྱེ་བ་གཞན་དུ་འགྲོ་བ་མེད་པའི་ཕྱིར་རོ།
en: Because going is unfindable”— because going to another birth based on a good form of life or a bad form of life does not exist. “

source: །གནས་མི་དམིགས་པའི་ཕྱིར་ཞེས་བྱ་བ་ནི་གནས་པའི་མཚན་ཉིད་མེད་པའི་ཕྱིར་རོ།
en: Because a standing place is unfindable”— because the defining mark of a standing place does not exist. “

source: །སྐྱེ་བ་མི་དམིགས་པའི་ཕྱིར་ཞེས་བྱ་བ་ནི་མེད་པ་ལས་བྱུང་བའི་མཚན་ཉིད་ཀྱི་སྐྱེ་བ་མེད་པའི་ཕྱིར་རོ།
en: Because birth is unfindable”— because a birth marked as having arisen from nonexistence does not exist. “

source: །དབུགས་མི་དམིགས་པའི་ཕྱིར་ཞེས་བྱ་བ་ནི་ཉམ་ཆུང་བའི་ཕྱིར་སྟོབས་མེད་པའོ།
en: Because breath is unfindable”— because it is feeble because it is weak. “

source: །ཆོས་མི་དམིགས་པའི་ཕྱིར་ཞེས་བྱ་བ་ནི་ཆོས་ཀྱི་རྣམ་པར་མེད་པའི་ཕྱིར་རོ།
en: Because a dharma is unfindable”— because it does not exist as the mental image of a dharma. “

source: །ནམ་མཁའ་དང་མཉམ་པ་ཉིད་མི་དམིགས་པའི་ཕྱིར་ཞེས་བྱ་བ་ནི་ཆོས་ཐམས་ཅད་ནམ་མཁའ་དང་མཉམ་པས་དམིགས་སུ་མེད་པའི་ཕྱིར་རོ།
en: Because a state the same as the sky is unfindable”— because all dharmas cannot be apprehended because they are the same as the sky. “

source: །ཟད་པ་མི་དམིགས་པའི་ཕྱིར་ཞེས་བྱ་བ་ནི་མི་རྟག་པ་ཉིད་ཀྱི་མཚན་ཉིད་ཀྱི་ཟད་པ་མི་དམིགས་པའི་ཕྱིར་རོ།
en: Because extinction is unfindable”— because an extinction marked by not being permanent is unfindable. “

source: །ཡེ་ཤེས་མི་དམིགས་པའི་ཕྱིར་ཞེས་བྱ་བ་ནི་ཤེས་བྱའི་དངོས་པོ་མེད་པས་མཚན་ཉིད་མེད་པའི་ཕྱིར་རོ།
en: Because knowledge is unfindable”— because in the absence of a real basis to be known its defining mark does not exist. “

source: །རྒྱུ་མེད་པ་མི་དམིགས་པའི་ཕྱིར་ཞེས་བྱ་བ་ནི་རྒྱུའི་མཚན་ཉིད་མེད་པའི་ཕྱིར་རོ།
en: Because a cause is unfindable”— because the mark of a cause does not exist.

source: །འཇིགས་པ་མི་དམིགས་པའི་ཕྱིར་ཞེས་བྱ་བ་ནི་རྣམ་པར་འཇིག་པའི་མཚན་ཉིད་འཇིགས་པ་མི་དམིགས་པའི་ཕྱིར་རོ།
en: Because destruction is unfindable”— because destruction, the defining mark of disintegration, is unfindable. “

source: །མདོག་མི་དམིགས་པའི་ཕྱིར་ཞེས་བྱ་བ་ནི་དེ་བཞིན་ཉིད་ལ་མདོག་མེད་ཅིང་འོད་མེད་པས་མི་སྣང་བའི་ཕྱིར་རོ།
en: Because a beautiful skin color is unfindable”— because suchness has no color and does not radiate because it has no light. “

source: །དྲན་པ་མི་དམིགས་པའི་ཕྱིར་ཞེས་བྱ་བ་ནི་དེ་བཞིན་ཉིད་དྲན་པར་བྱེད་པའི་ཤེས་པའི་སྤྱོད་ཡུལ་མ་ཡིན་པའི་ཕྱིར་རོ།
en: Because mindfulness is unfindable”— because it is not within the range of knowledge that is mindful of suchness. “

source: །བོད་པ་མི་དམིགས་པའི་ཕྱིར་ཞེས་བྱ་བ་ནི་མིང་གི་སྤྱོད་ཡུལ་མ་ཡིན་པའི་ཕྱིར་ཏེ། མིང་ནི་བོད་པའོ།
en: Because calling out is unfindable”— because it is not within the range of names. “

source: །ཆོས་རྣམས་ལ་སྤྲོ་བ་མི་དམིགས་པའི་ཕྱིར་ཞེས་བྱ་བ་ནི་ཆོས་ཐམས་ཅད་གཡོ་བ་མེད་པའི་ཕྱིར་རོ།
en: Because eagerness is unfindable”— because all phenomena are inactive. “

source: །སྟུག་པོ་མི་དམིགས་པའི་ཕྱིར་ཞེས་བྱ་བ་ནི་སྟུག་པོར་རྣམ་པར་རྟོག་པ་ལོག་པ་ཡིན་པའི་ཕྱིར་རོ།
en: Because density in dharmas is unfindable”— because the idea of density is in error. “

source: །རྣམ་པར་བསྒྲུབ་པ་མི་དམིགས་པའི་ཕྱིར་ཞེས་བྱ་བ་ནི་འདུ་བྱེད་རྣམ་པར་དགོད་པ་ལ་རྣམ་པར་བསྒྲུབ་པ་ཞེས་བྱ་བ་སྟེ། དེ་མེད་པའི་ཕྱིར་རོ།
en: Because establishment is unfindable”— because an “establishment” would be an array of the compounded and that does not exist. “

source: །ཉོན་མོངས་པ་མེད་པའི་ཕྱིར་ཞེས་བྱ་བ་ནི་ཉོན་མོངས་པའི་ཉོན་མོངས་པ་དང་། རྣམ་པར་རྟོག་པའི་ཉོན་མོངས་པ་དང་བྲལ་བའི་ཕྱིར་རོ།
en: Because conflict is unfindable”— because it is separated from the conflict of afflictive emotion and from the conflict of conceptualization. “

source: །འབྲས་བུ་མི་དམིགས་པའི་ཕྱིར་ཞེས་བྱ་བ་ནི་འབྲས་བུའི་ཆོས་རྣམས་ལ་འབྲས་བུའི་རྣམ་པ་མི་དམིགས་པའི་ཕྱིར་རོ།
en: Because a result is unfindable”— because the mental image of a result is unfindable in all the phenomena that are the results. “

source: །ཕུང་པོ་མི་དམིགས་པའི་ཕྱིར་ཞེས་བྱ་བ་ནི་ཉོན་མོངས་པ་དང་། ལས་དང་རྣམ་པར་སྨིན་པའི་ཕུང་པོ་རྣམས་མེད་པའི་ཕྱིར་རོ།
en: Because aggregates are unfindable”— because there are no masses of afflictions, karma, and maturation. “

source: །རྒ་བ་མི་དམིགས་པའི་ཕྱིར་ཞེས་བྱ་བ་ནི་གནས་པ་ལས་གཞན་དུ་འགྱུར་བའི་མཚན་ཉིད་ཀྱི་རྒ་བ་མེད་པའི་ཕྱིར་རོ།
en: Because old age is unfindable”— because an old age marked by change from one state to another does not exist. “

source: །སྤྱོད་པ་མི་དམིགས་པའི་ཕྱིར་ཞེས་བྱ་བ་ནི་འགྲོ་བ་དང་། འོང་བའི་སྤྱོད་པ་མི་དམིགས་པའི་ཕྱིར་རོ།
en: Because conduct is unfindable”— because the conduct of going and coming is unfindable. “

source: །སྡིགས་པ་མི་དམིགས་པའི་ཕྱིར་ཞེས་བྱ་བ་ནི་རྣམ་པར་འཚེ་བ་མེད་པའི་ཕྱིར་རོ།
en: Because harm is unfindable”— because violence does not exist. “

source: །ངར་འཛིན་པ་མི་དམིགས་པའི་ཕྱིར་ཞེས་བྱ་བ་ནི་ལྟ་བའི་བདག་ཉིད་དང་། ང་རྒྱལ་གྱི་བདག་ཉིད་ཀྱི་ངར་འཛིན་པ་མེད་པའི་ཕྱིར་རོ།
en: Because grasping at something as ‘I’ is unfindable”— because grasping at something as ‘I’ constitutes a view and that constitutes conceit, which does not exist. “

source: །གང་གིས་ཐ་སྙད་འདོགས་པ་དང་། གང་གིས་བརྗོད་པ་དང་། གང་གིས་བསྟན་པ་ཞེས་བྱ་བ་ནི་སྨྲ་བའི་ཆོས་སོ། །གང་གིས་རྟོག་པར་བྱེད་པ་དང་། གང་གིས་མཐོང་བ་ཞེས་བྱ་བ་ནི་ཉན་པ་པོའི་ཆོས་སོ།
en: By which anything might be conventionally designated, or by which anything might be expressed, expounded”— a speaker’s duty—or “by which anything might be… realized, or seen— a listener’s duty. “

source: །གང་གིས་ཐ་སྙད་འདོགས་ཞེས་བྱ་བ་ནི་གང་འཕགས་པ་རྣམས་དང་། འཕགས་པ་
en: By which anything might be conventionally designated.”

source: མ་ཡིན་པ་རྣམས་ཀྱིས་མཐོང་བ་དང་། ཐོས་པ་དང་། བྱེ་བྲག་ཕྱེད་པ་དང་། རྣམ་པར་ཤེས་པའི་དབང་དང་། མ་མཐོང་བ་དང་། མ་ཐོས་པ་དང་། བྱེ་བྲག་མ་ཕྱེད་པ་དང་། རྣམ་པར་མ་ཤེས་པའི་དབང་སྟེ། ཐ་སྙད་བཅུ་དྲུག་གི་དབང་གིས་བརྗོད་དོ།
en: These are the noble and ignoble utterances based on sixteen conventional designations governed by having seen, heard, thought, and known, and also governed by not having seen, heard, thought, or known. “

source: །གང་གིས་བརྗོད་ཅེས་བྱ་བ་ནི་བུམ་པ་དང་། སྣམ་བུ་དང་བ་གླང་དང་། རྟ་ལ་སོགས་པའི་མིང་བརྗོད་པའི་དབང་གིས་བརྗོད་པའོ།
en: By which anything might be expressed”: utterances based on a pot, a cloth, a bull, a horse and so on. “

source: །གང་གིས་སྟོན་པ་ཞེས་བྱ་བ་ནི་རིང་པོ་དང་ཐུང་ངུ་དང་། དཀར་ཤམ་དང་། སྔོ་བསངས་དང་། སྔོན་པོ་དང་། སེར་པོ་ལ་སོགས་པའི་ཡོན་ཏན་བསྟན་པའི་དབང་གིས་བརྗོད་དོ།
en: By which anything might be expounded”: utterances governed by the indication of qualifying attributes—long, short, light, dark, blue, yellow and so on.

source: །ཉན་པ་པོ་ཡང་རྗེས་སུ་དག་པའི་དབང་གིས་དོན་རྗེས་སུ་རྟོགས་པར་བྱེད་པ་སྟེ། གང་གིས་རྟོགས་པ་ཞེས་བྱ་བ་ནི་རྗེས་སུ་དཔག་པའི་དབང་གིས་བརྗོད་དོ།
en: Based on a listener also deducing the meaning, utterances “by which anything might be realized” are based on deducing, which cause it to be subsequently realized.

source: །གང་གིས་མཐོང་བ་ཞེས་བྱ་བ་དེ་ནི་མངོན་སུམ་གྱི་དོན་མཐོང་བའི་དབང་གིས་བརྗོད་དོ།
en: Utterances “by which anything might be seen” are based on them seeing the meaning with direct perception. “

source: །སྒྲ་གང་ལ་ཡང་ཐོགས་པར་མི་འགྱུར་རོ་ཞེས་བྱ་བ་ནི་བརྗོད་པ་ཐམས་ཅད་ལ་དོན་དམ་པ་ཚོལ་བར་འགྱུར་བའོ།
en: Will not become perplexed whatever the sound”— they will seek for the ultimate in all statements. “

source: །ཆོས་ཐམས་ཅད་མཉམ་པ་ཉིད་ཀྱིས་ཡང་དག་པར་སྒྲུབ་པར་འགྱུར་ཏེ་ཞེས་བྱ་བ་ནི་སྒྲ་ཐམས་ཅད་དེ་བཞིན་ཉིད་དུ་སྦྱོར་བར་བྱེད་པའོ།
en: Will succeed though the sameness of dharmas”— they will make a connection between all sounds and suchness. “

source: །སྒྲ་ཤེས་པ་ལ་མཁས་པ་ཡང་ཞེས་བྱ་བ་ནི་སེམས་ཅན་ཐམས་ཅད་ཀྱི་སྐད་དང་། བསམ་པ་ཐམས་ཅད་ཤེས་པའོ།
en: Skill in understanding sounds” is understanding the languages and thoughts of all beings. “

source: །དྲན་པ་ནི་མི་བརྗེད་པའོ།
en: Mindfulness” is not forgetting. “

source: །བློ་གྲོས་ཞེས་བྱ་བ་ནི་དོན་དམ་པའི་རྗེས་སུ་འབྲང་བའི་ཤེས་རབ་སྟེ། བློ་གྲོས་དང་། ཡིད་གཞུངས་པ་དང་། མྱུར་དུ་མང་པོ་འཛིན་པའི་བདག་ཉིད་དེ། དེའི་དབང་གིས་ཤེས་རབ་མྱུར་བ་ཞེས་བྱའོ།
en: Intelligence” is wisdom that follows the ultimate constituted by the intellect, mental fortitude, and a quick grasp of a lot, based on which you say someone is “quick-witted.” “

source: །བློ་ནི་ཀུན་རྫོབ་ཀྱི་སྤྱོད་ཡུལ་ལོ།
en: Awareness” ranges over the conventional.

source: །ལྷག་མ་ནི་དོན་གསལ་ལོ།
en: The meaning of the rest is obvious. 7.

source: །འདི་ནི་ཐེག་པ་ཆེན་པོ་བསྟན་པ་སྟེ།
en: How have they come to set out in the Great Vehicle?

source: དེ་ལྟར་ཐེག་པ་ཆེན་པོ་བསྟན་པ་ཡོངས་སུ་རྫོགས་པར་བྱས་ནས།
en: This has been the exposition of the Great Vehicle.

source: ད་ནི་ཞུས་པ་གཉིས་པ་སྐབས་དབྱེ་བ་སྟེ། ཇི་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཐེག་པ་ཆེན་པོ་ལ་ཡང་དག་པར་ཞུགས་པ་ཡིན་ཞེས་ཟེར་བ་ཞེས་བྱ་བ་ནི་འོག་ནས་འབྱུང་བའི་ས་བཅུ་པོ་དག་ལ་ཞུགས་པ་ནི་ཐེག་པ་ཆེན་པོ་ལ་ཡང་དག་པར་ཞུགས་པ་ཞེས་བྱ་སྟེ།
en: Having thus completed the exposition of the Great Vehicle, now, setting the scene for the second of the questions with, “Subhūti, in regard to what you have asked—‘How have bodhisattva great beings come to set out in the Great Vehicle?’ ” it says those who have set out on the following ten levels “come to set out in the Great Vehicle.”

source: དེས་ན་ཐེག་པ་ཆེན་པོ་ལ་ཡང་དག་པར་ཞུགས་པ་ཡིན་ནོ་ཞེས་བཅོམ་ལྡན་འདས་ཀྱིས་བསྟན་པ་དང་། བྱང་ཆུབ་སེམས་དཔའི་ས་བཅུ་དང་། ས་ཡོངས་སུ་སྦྱང་བར་བྱ་བ་ཞུས་སོ།
en: With this the Lord teaches that they have set out in the Great Vehicle and poses a question about the ten bodhisattva levels and what has to be done for the purifications. “

source: །ཆོས་ཐམས་ཅད་འཕོ་བ་མེད་པས་ཞེས་བྱ་བ་ནི་དེ་བཞིན་ཉིད་ནི་ནམ་མཁའ་དང་མཚུངས་ཏེ། འཕོ་བ་མེད་པས་འཕོ་བ་མེད་པའི་ཡེ་ཤེས་ནི་ས་གཞན་དུ་འཕར་བའི་རྒྱུ་ཡིན་པར་བསྟན་ཏོ།
en: By all dharmas not changing place”— this teaches that suchness is like space and does not change places, and hence the knowledge that does not go on to some other place is the cause of passing on to another level. “

source: །ཆོས་རྣམས་ཀྱི་གང་ཡིན་པ་དེ་ལ་ཡང་རློམ་སེམས་སུ་མི་བྱེད་ལ་ས་ཡོངས་སུ་སྦྱོང་བར་ཡང་བྱེད་དོ་ཞེས་བྱ་བས་ས་གཞན་དུ་འཕར་བའི་རྒྱུ་བསྟན་ཏོ།
en: But even though they do not falsely project the level of those dharmas… they still do the purification for a level” teaches the cause of the moving up to the next level.

source: །འཕོ་བ་མེད་པ་དང་། འགྲོ་བ་མེད་པ་དང་། འོང་བ་ལ་སོགས་པ་མེད་པའི་ཕྱིར་ཆོས་རྣམས་ཀྱི་ས་ལ་རློམ་སེམས་མི་བྱེད་ཀྱང་ལས་རྣམས་མི་བྱེད་པ་ནི་མ་ཡིན་ནོ་ཞེས་བྱ་བའི་ཐ་ཚིག་སྟེ། འདི་ནི་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་ཐབས་མཁས་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པའི་བྱ་བ་བསྟན་ཏོ།
en: It means that because changing places does not exist, going does not exist, and coming and so on does not exist, they do not falsely project the level of those dharmas, but it is not that they do not do the work, so it is teaching the activity of the perfection of skillful means of bodhisattvas.

source: །ཐབས་མཁས་པ་ནི་ཀུན་རྫོབ་དང་། དོན་དམ་པའི་ཚུལ་གཉིས་ཤིན་ཏུ་འགལ་བ་འདྲ་བ་ཡང་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་དགོས་པ་ཐམས་ཅད་ལ་འགལ་བ་མེད་པར་བསྒྲུབ་པའོ།
en: As for the skill in means, even though the ultimate and the conventional modes seem to absolutely contradict each other, bodhisattvas achieve everything necessary without a contradiction.

source: །ས་ཡོངས་སུ་སྦྱོང་བ་དེ་དག་ཀྱང་སྔར་གླེངས་ཏེ་བསྟན་ནས། ཕྱིས་བཤད་པའི་འགྲེས་ལ་བཅོམ་ལྡན་འདས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ས་དང་པོ་ལ་གནས་པའི་ལྷག་པའི་བསམ་པ་ཡོངས་སུ་སྦྱང་བར་བགྱི་བ་གང་ལགས་ཞེས་བྱ་བ་ལ་སོགས་པས་བཤད་དོ།
en: First it gives an introductory explanation of those level purifications, and then in a later explanatory section it says, “Lord, what is done in purification of the surpassing aspiration of bodhisattva great beings occupying the first level?”

source: །སེམས་ཅན་ཐམས་ཅད་ཀྱི་དོན་གྱི་ཕྱིར་ཐེག་པ་ཆེན་པོའི་ཡེ་ཤེས་ཡོངས་སུ་ཚོལ་བ་ལ་འཇུག་པ་ཞེས་བྱ་བ་ལ།
en: and so on. “For the sake of all beings they engage in the quest for knowledge of the Great Vehicle.” “

source: ཐེག་པ་ཆེན་པོའི་ཡེ་ཤེས་ཞེས་བྱ་བ་ནི་རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་ཡེ་ཤེས་སོ།
en: Knowledge of the Great Vehicle” is the knowledge of a knower of all aspects.

source: །དེ་ལ་ཚོལ་བ་ནི་སྨོན་ལམ་གདབ་པ་དང་། སེམས་བསྐྱེད་པ་སྟེ།
en: The “quest for” is making a prayer that is a vow for that, and producing the thought of it.

source: འདི་ལྟར་སེམས་ཅན་ཐམས་ཅད་ཀྱི་དོན་དུ་སངས་རྒྱས་ཀྱི་ས་ཡོངས་སུ་ཚོལ་བའོ།
en: Thus, it is seeking the level of a buddha for the sake of all beings.

source: །འདི་ནི་སེམས་ཅན་ཐམས་ཅད་ལ་ཕན་པའི་དངོས་པོ་ཡོངས་སུ་སྦྱོང་བའོ།། །།བམ་པོ་བཅོ་ལྔ་པ།
en: This is “the purification of the basis for the benefit” of all beings.

source: དེ་ལས་ཡོངས་སུ་སྦྱོང་བར་འདོད་པས་ཐོག་མར་བསམ་པ་ཡོངས་སུ་སྦྱང་བར་བྱའོ།
en: Among these, first, those who want to carry out purification must purify the “aspiration.”

source: །དེའི་འོག་ཏུ་སྒྲུབ་པ་ནི་སེམས་ཅན་ཐམས་ཅད་ལ་ཕན་པའི་རྩ་བ་ཡིན་པའི་ཕྱིར་ཕན་པའི་སེམས་སུ་བྱའོ།
en: Then there is the accomplishment. Because it has the benefit of all beings as its root, they must produce the thought to be “beneficial.”

source: །དེ་ཡང་སེམས་ཅན་ཐམས་ཅད་ལ་སེམས་སྙོམས་པ་ལས་འབྱུང་བའི་ཕྱིར་སེམས་མཉམ་པ་ཉིད་དུ་བྱའོ།
en: Because that comes from thinking equally about all beings they must produce “the same state of mind.”

source: །དང་པོ་ནི་སྦྱིན་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པའི་ས་ཡིན་པས་ན་གཏོང་བ་ཡོངས་སུ་སྦྱང་བར་བྱའོ།
en: The first level is of the perfection of giving, so they must purify “giving up things.”

source: །དག་པའི་ས་ཐོབ་པར་བྱ་བ་ལ་སྔར་བྱ་བ་ཡིན་པས་དགེ་བའི་བཤེས་གཉེན་གདོན་མི་ཟ་བར་དགོས་པའི་ཕྱིར་དེ་ལ་བརྟེན་པར་བྱའོ།
en: As a preliminary to reaching the pure levels, “spiritual friends” are an absolute necessity, so they must “serve” them.

source: །དེའི་འོག་ཏུ་དགེ་བའི་བཤེས་གཉེན་ལས་དམ་པའི་ཆོས་མཉན་པར་བྱ་དགོས་པས་ཆོས་ཡོངས་སུ་བཙལ་བར་བྱའོ།
en: Then they have to hear the true doctrine from spiritual friends, so they must “seek the doctrine.”

source: །རྒྱུད་ཡོངས་སུ་མ་སྨིན་པའི་ཕྱིར་མངོན་པར་འབྱུང་བ་ལ་གནས་པ་ཉིད་དུ་བྱའོ།
en: Because their mindstreams have not yet reached maturity they must remain in “renunciation.”

source: །རྟག་ཏུ་རྒྱུན་མི་ཆད་པར་སངས་རྒྱས་ཀྱི་སྐུ་དང་། སངས་རྒྱས་ཉིད་ལ་འདོད་པར་བྱའོ།
en: They must constantly and always “long for the body of a buddha” and for buddhahood.
